app/views/admin/pages/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category_id %><br />
    <%= f.select :category_id, options_for_select(Category.all.collect{|c|[ c.name, c.id]}, @page.category_id) %>