app/controllers/admin/games_controller.rb

  def index
    @games = Game.page(params[:page]).per(4)
---
SELECT "games".* FROM "games" ORDER BY title
SELECT "pages".* FROM "pages"
SELECT COUNT(*) FROM "games"

  def show
  	@all_games = Game.all
    @game = Game.find(params[:id])
---
SELECT "games".* FROM "games"
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", "4"]]

  def create
    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("about", "created_at", "features", "genre", "slogan", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["about", ""], ["created_at", Tue, 13 Nov 2012 07:41:49 UTC +00:00], ["features", ""], ["genre", ""], ["slogan", ""], ["title", ""], ["updated_at", Tue, 13 Nov 2012 07:41:49 UTC +00:00]]

  def update
    @game = Game.find(params[:id])

    respond_to do |format|
      if @game.update_attributes(params[:game])
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", "4"]]
UPDATE "games" SET "title" = 'jhjughj', "slogan" = 'jhgjgh', "genre" = 'jhgj', "about" = 'jgh', "updated_at" = '2012-11-13 08:28:10.581163' WHERE "games"."id" = 4