app/controllers/admin/pages_controller.rb

  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("body", "category_id", "created_at", "featured", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "Blog posts"], ["category_id", 1], ["created_at", Tue, 13 Nov 2012 04:00:03 UTC +00:00], ["featured", false], ["title", "Blog"], ["updated_at", Tue, 13 Nov 2012 04:00:03 UTC +00:00]]