app/controllers/admin/posts_controller.rb

SELECT "pages".* FROM "pages"
SELECT "posts".* FROM "posts" ORDER BY title
---
  def index
    @posts = Post.page(params[:page]).per(4)

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "dgfgdfgdfgdf \r\n\r\n\r\n\r\njhjgjghj"], ["created_at", Tue, 13 Nov 2012 05:46:42 UTC +00:00], ["title", "gdfgdfg"], ["updated_at", Tue, 13 Nov 2012 05:46:42 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "posts" SET "body" = 'sjadjsdhsdfgadhj fgdshjfkafgdhjsfkldsjfdsafkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk kkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk kkkkkkkkkkkkkkkkkkk.', "updated_at" = '2012-11-13 08:44:35.856518' WHERE "posts"."id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])