app/controllers/home_controller.rb

SELECT "games".* FROM "games" LIMIT 2
---
	def index
		@games = Game.all(:limit => 2) #where(:featured => true)