app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save